Documents/ВозвратПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратПродукции</Name>
			<Comment>Возврат произведенного потолка или другой продукции</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаИсполнителейПроизводства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОтветственностьЗаБракиНаПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БракПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОтветственностьИсполнителейПоСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходоватьТоварНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаВыработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатусВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыВозвратаПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УменьшитьДолгКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчитыватьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидБонуснойСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусыКНачислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияСебестоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОпределенияСебестоимостиПоВозвратам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияОтветственности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОпределенияОтветственностиПоВозвратам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ИдентификаторОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ответственные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Comment>#12822</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратПродукции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ДокументОснование = Неопределено;
		МассивТоваров = Неопределено;
		Если ДанныеЗаполнения.Свойство("ДокументОснование", ДокументОснование) И 
			ДанныеЗаполнения.Свойство("МассивТоваров", МассивТоваров) Тогда
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ЗаполнитьПоЗаказуПокупателя(ДокументОснование, МассивТоваров);
				
			ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
				ЗаполнитьПоРеализации(ДокументОснование, МассивТоваров);	
	
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		ЗаполнитьПоВыпуску(ДанныеЗаполнения);
			
	КонецЕсли;
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Расход", Ложь);
	СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Доход");
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// №5441
	Если НЕ ПриходоватьТоварНаСклад Тогда
		Если ПроверяемыеРеквизиты.Найти("Склад") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));
		КонецЕсли;
	КонецЕсли;
	
	//проверки
	Если БракПроизводства И Ответственные.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена таблица ответственных", ЭтотОбъект, "Ответственные[0]", ,Отказ);
	КонецЕсли;
	
	//#15395 
	Если ТекущийСтатусВозврата = Справочники.СтатусыВозвратаПродукции.Проверено Тогда
		Для каждого СтрокаТабличнойЧасти из Товары Цикл
			
			Если ПриходоватьТоварНаСклад И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости)
				Тогда
				ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан вариант определения себестоимости!";
				ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ВариантОпределенияСебестоимости";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
			КонецЕсли;
			
			Если ПриходоватьТоварНаСклад И СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи
				И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
				ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан документ продажи при варианте определения себестоимости по документу продажи!";
				ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ДокументПродажи";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
			КонецЕсли;
			
			Если БракПроизводства И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВариантОпределенияОтветственности)
				Тогда
				ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан вариант определения ответственности!";
				ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ВариантОпределенияОтветственности";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
			КонецЕсли;
			
			Если БракПроизводства И СтрокаТабличнойЧасти.ВариантОпределенияОтветственности = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПоСебестоимости
				И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи)
				Тогда
				ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан документ продажи при варианте определения ответственности по себестоимости документа продажи!";
				ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ДокументПродажи";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// #15628 очистка полей
	Для каждого СтрокаТЧ из Товары Цикл		
		Если НЕ БракПроизводства Тогда 
			СтрокаТЧ.ВариантОпределенияОтветственности = Перечисления.ВариантыОпределенияОтветственностиПоВозвратам.ПустаяСсылка();
			СтрокаТЧ.Ответственность = 0;
		КонецЕсли;
		
		Если НЕ ПриходоватьТоварНаСклад Тогда
			СтрокаТЧ.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПустаяСсылка();
			СтрокаТЧ.Себестоимость = 0; 
		КонецЕсли;		
	КонецЦикла;
		
	Если НЕ РольДоступна("ПолныеПрава") 
		И НЕ РольДоступна("АдминистраторСистемы")
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноРедактироватьВозвратыПродукцииВСтатусеПроверен")
		И ТекущийСтатусВозврата = Справочники.СтатусыВозвратаПродукции.Проверено
		И ТекущийСтатусВозврата = Ссылка.ТекущийСтатусВозврата Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует право на изменение документа в статусе ""Проверено""",,,,Отказ);
	КонецЕсли;	
	
	//#15395
	СуммаАванса = ПолучитьСуммуЗачета();
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ ТекущийСтатусВозврата = Справочники.СтатусыВозвратаПродукции.Проверено Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	
	// регистр ТоварыНаСкладах
	Если ПриходоватьТоварНаСклад Тогда
		
		ОрганизацияТоваров = Организация;
		Если Константы.ОбщиеСклады.Получить() Тогда
			ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
		
		МассивДокументовПродажи = Товары.ВыгрузитьКолонку("ДокументПродажи");
		ТаблицаСебестоимости = ОбщийМодульСервер.ТаблицаСебестоимостиПродаж(МассивДокументовПродажи);
		
		Движения.ТоварыНаСкладах.Записывать = Истина;
		Для Каждого Товар Из Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Товар.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			
			Приход = Движения.ТоварыНаСкладах.Добавить();
			Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
			Приход.Период = Дата;
			Приход.Организация = ОрганизацияТоваров;
			Приход.Склад = Склад;
			Приход.Номенклатура = Товар.Номенклатура;
			Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Приход.Количество = Товар.Количество * Товар.Коэффициент;
			
			//#15395 изменено
			//Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
			//Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); 
						
			Если Товар.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи Тогда
				Если ТаблицаСебестоимости.Количество() > 0 Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Номенклатура", 				 Товар.Номенклатура);
					Отбор.Вставить("ХарактеристикаНоменклатуры", Товар.ХарактеристикаНоменклатуры);
					Отбор.Вставить("СерияНоменклатуры", 		 Товар.СерияНоменклатуры);
					Отбор.Вставить("Регистратор", 				 Товар.ДокументПродажи);
					
					НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						//Приход.Сумма = НайденныеСтроки[0].Сумма;
						//Приход.СуммаВал = НайденныеСтроки[0].СуммаВал;
						Приход.Сумма = НайденныеСтроки[0].Цена * Приход.Количество;
						Приход.СуммаВал = НайденныеСтроки[0].ЦенаВал * Приход.Количество;
					Иначе
						Приход.Сумма = 0;
						Приход.СуммаВал = 0;
					КонецЕсли;
				Иначе
					Приход.Сумма = 0;
					Приход.СуммаВал = 0;
				КонецЕсли;
			Иначе
				Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Себестоимость);
				Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Себестоимость);		
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если УменьшитьДолгКонтрагента Тогда

		ВремСуммаДокумента = 0;
		ВремСуммаДокумента = Товары.Итог("Сумма");
		Если НЕ Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход(Ссылка, Организация, Контрагент, ДоговорКонтрагента, ВремСуммаДокумента) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// регистр Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = ДоговорКонтрагента;
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаДокумента;
		
		//#15395 
		// регистр РасчетыПоЗаказам 
		СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из ЗачетАванса Цикл
			Если ТекущаяСтрока.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.Документ));
			Если НайденныйВидДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Движение.Контрагент = Контрагент;
			Если ТекущаяСтрока.Документ.Валюта = Валюта ИЛИ ТекущаяСтрока.СуммаВВалютеДокумента = 0 Тогда 
				Движение.Сумма = ТекущаяСтрока.Сумма;
			Иначе
				Движение.Сумма = ТекущаяСтрока.СуммаВВалютеДокумента; 
			КонецЕсли; 
							
		КонецЦикла;
		
	КонецЕсли;
	
	// регистр ВыработкаИсполнителейПроизводства
	Если БракПроизводства Тогда		
		//++ №14187 выработка по ТЧ
		Движения.ВыработкаИсполнителейПроизводства.Записывать = Истина;
		
		Если РучнаяКорректировкаВыработки Тогда
			ТаблицаВыработки = Выработка;
		Иначе
			ТаблицаВыработки = Документы.ВозвратПродукции.ПолучитьТаблицуВыработки(ЭтотОбъект);
		КонецЕсли;
		
		Для Каждого СтрокаВыработки Из ТаблицаВыработки Цикл
			
			Движение = Движения.ВыработкаИсполнителейПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаВыработки, "Сотрудник, Номенклатура, ЕдиницаИзмерения");
			
			Движение.Количество = -СтрокаВыработки.Количество;
			Движение.Цена = -СтрокаВыработки.Цена;
			Движение.Стоимость = -СтрокаВыработки.Стоимость;
			
			Движение.Период = Дата;
			Движение.ВидНачисления = Справочники.ВидыНачислений.ШтрафЗаБрак;
			Движение.Подразделение = Подразделение;
			Движение.ОбъектВыработки = Ссылка;
			
		КонецЦикла;
		//-- №14187		
	КонецЕсли;
	
	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.Склад = Склад;  //#12367
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ДокументПродажи = ?(ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи), ТекущаяСтрока.ДокументПродажи, Основание);
		Движение.ЗаказПокупателя = ТекущаяСтрока.ЗаказПокупателя;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = -ТекущаяСтрока.Количество;	//#14300
		Движение.Количество = -ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма = -РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = -РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
		
		Если ЗначениеЗаполнено(Движение.ЗаказПокупателя) Тогда
			//Движение.АдресМонтажа = Движение.ЗаказПокупателя.АдресМонтажа;
			Движение.ПодразделениеЗаказа = Движение.ЗаказПокупателя.Подразделение;		
		КонецЕсли;		
	КонецЦикла;
	
	// регистр БонусыКонтрагентов
	Если СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя 
		И СуммаБонусовКНачислениюПоДисконтнойКарте > 0 
		И ((СлужебныйУчетБонусовПоДисконтнымКартам И НЕ ДисконтнаяКарта.Пустая())
		    ИЛИ НЕ СлужебныйУчетБонусовПоДисконтнымКартам) Тогда
		
		Движения.БонусыКонтрагентов.Записывать = Истина;

		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ДисконтнаяКарта = ?(СлужебныйУчетБонусовПоДисконтнымКартам, ДисконтнаяКарта, Справочники.ДисконтныеКарты.ПустаяСсылка());
		Движение.Контрагент = Контрагент;
		Движение.Сумма = -СуммаБонусовКНачислениюПоДисконтнойКарте;
		
	КонецЕсли;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов 
		И ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов
		И НЕ БракПроизводства // №10680 галочка "Назначить ответсвенных за брак" не должна формировать движений по доходам и расходам
	Тогда
			
		Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
		Движения.ДоходыРасходы.Записывать = Истина;
		
		Если НЕ СтатьяДоходов.Пустая() И ПриходоватьТоварНаСклад И НЕ БракПроизводства Тогда								
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходов;
			Движение.Метод		 	= Метод;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
			Движение.СуммаРасходов 	= 0;
		КонецЕсли;
		
		Если НЕ СтатьяРасходов.Пустая() И НЕ ПриходоватьТоварНаСклад И БракПроизводства Тогда								
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходов;
			Движение.Метод		 	= Метод;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
		КонецЕсли;
		
		Если НЕ СтатьяРасходов.Пустая() И УменьшитьДолгКонтрагента Тогда								
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяРасходов;
			Движение.Метод		 	= Метод;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДокумента);
		КонецЕсли;
			
	КонецЕсли;
	
	//++ №8749
	
	//#12822 закомментировано: Документ никогда не должен делать движений по регистру "Заказы покупателей"
	//Движения.ЗаказыПокупателей.Записывать = Истина;
	//Для Каждого ТекущаяСтрока Из Товары Цикл
	//	
	//	Если ТекущаяСтрока.ЗаказПокупателя.Пустая() Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//		
	//	Движение = Движения.ЗаказыПокупателей.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.ЗаказНаПроизводство = ТекущаяСтрока.ЗаказПокупателя;
	//	Движение.Организация = Организация;
	//	Движение.Контрагент = Контрагент;
	//	Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
	//	Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
	//	Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
	//	Движение.Количество = -(ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент); 
	//	Движение.Сумма = -(ТекущаяСтрока.Сумма + ТекущаяСтрока.БонусыКНачислению); //#9777, #10397
	//	
	//КонецЦикла;
	
	//РасчетыПоЗаказам	
	//#15395 - закомментировано, есть отдельная таблица
	//Движения.РасчетыПоЗаказам.Записывать = Истина;
	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") И Не Основание.Пустая() И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить() Тогда
	//	
	//	Для Каждого ТекущаяСтрока Из Товары Цикл
	//		
	//		Движение = Движения.РасчетыПоЗаказам.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Заказ = Основание;
	//		Движение.Сумма = ТекущаяСтрока.Сумма;
	//		Движение.Контрагент = Контрагент;
	//		
	//	КонецЦикла;
	//КонецЕсли;	
	//-- №8749
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//ОтветственностьИсполнителейПоСебестоимости = Константы.ВозвратПродукцииОтветственностьИсполнителейПоСебестоимости.Получить();
		
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		СлужебныйУчитыватьБонусы 				= Константы.УчитыватьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
		СлужебныйВидБонуснойСистемы 			= Константы.ВидБонуснойСистемы.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДокументОснование, МассивТоваров = Неопределено)
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДокументОснование);

	Основание 			= ДокументОснование;
	Организация 		= ДокументОснование.Организация;
	Подразделение 		= ДокументОснование.Подразделение;
	Контрагент 			= ДокументОснование.Контрагент;
	ДоговорКонтрагента 	= ДокументОснование.ДоговорКонтрагента;
	Валюта 				= ДокументОснование.Валюта;
	Склад 				= ДокументОснование.Склад;
	
	ТаблицаПродаж = ПолучитьТаблицуПродажПоЗаказу(ДокументОснование, ЭтотОбъект.Ссылка);
	
	Если НЕ МассивТоваров = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из МассивТоваров Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			//НоваяСтрока.ЗаказПокупателя = ДокументОснование;
			//#15395 
			//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
			НоваяСтрока.ДокументПродажи = НайтиДокументПродажиПоДаннымТабличнойСтроки(ТаблицаПродаж, НоваяСтрока, ДокументОснование);
		КонецЦикла;
	Иначе
		Для Каждого ТекущаяСтрока Из ДокументОснование.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				//потолок
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ЗаказПокупателя = ДокументОснование;
				//#15395 
				//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
	            НоваяСтрока.ДокументПродажи = НайтиДокументПродажиПоДаннымТабличнойСтроки(ТаблицаПродаж, НоваяСтрока, ДокументОснование);
				
				//услуги потолка
				Для каждого СтрокаУслуги Из ДокументОснование.Товары Цикл
					ЭтоУслуга = Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаУслуги.Номенклатура);
					Если ЭтоУслуга и СтрокаУслуги.Потолок = ТекущаяСтрока.Номенклатура Тогда
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
						НоваяСтрока.ЗаказПокупателя = ДокументОснование;
						//#15395 
						//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
						НоваяСтрока.ДокументПродажи = НайтиДокументПродажиПоДаннымТабличнойСтроки(ТаблицаПродаж, НоваяСтрока, ДокументОснование);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоРеализации(ДокументОснование, МассивТоваров = Неопределено)
	
	Основание 			= ДокументОснование;
	Организация 		= ДокументОснование.Организация;
	Подразделение 		= ДокументОснование.Подразделение;
	Контрагент 			= ДокументОснование.Контрагент;
	ДоговорКонтрагента 	= ДокументОснование.ДоговорКонтрагента;
	Валюта 				= ДокументОснование.Валюта;
	Склад 				= ДокументОснование.Склад;
	ДисконтнаяКарта 	= ДокументОснование.ДисконтнаяКарта;
	
	Если НЕ МассивТоваров = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из МассивТоваров Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			//НоваяСтрока.ЗаказПокупателя = ТекущаяСтрока.Заказ;
			
			//#15395
			//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
			НоваяСтрока.ДокументПродажи = ДокументОснование;
		КонецЦикла;
	Иначе
		Для Каждого ТекущаяСтрока Из ДокументОснование.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
				//потолок
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ЗаказПокупателя = ТекущаяСтрока.Заказ;
				НоваяСтрока.БонусыКНачислению = ТекущаяСтрока.СкидкаБонусами;
				
				//#15395 
				//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
				НоваяСтрока.ДокументПродажи = ДокументОснование;
				
				//услуги потолка
				Для каждого СтрокаУслуги Из ДокументОснование.Услуги Цикл
					ЭтоУслуга = Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаУслуги.Номенклатура);
					Если ЭтоУслуга и СтрокаУслуги.Потолок = ТекущаяСтрока.Номенклатура Тогда
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
						НоваяСтрока.БонусыКНачислению = СтрокаУслуги.СкидкаБонусами;
						НоваяСтрока.ЗаказПокупателя = СтрокаУслуги.Заказ;
						
						//#15395 
						//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи; // #15628 закомментировано
						НоваяСтрока.ДокументПродажи = ДокументОснование;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДокументОснование, МассивТоваров = Неопределено)
	
	Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДокументОснование);
	
	Если НЕ ДокументОснование.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
		Возврат;
	КонецЕсли;
	
	Основание 			= ДокументОснование;
	Организация 		= ДокументОснование.Организация;
	Подразделение 		= ДокументОснование.Подразделение;
	Контрагент 			= ДокументОснование.Контрагент;
	ДоговорКонтрагента 	= ДокументОснование.ДоговорКонтрагента;
	Валюта 				= ДокументОснование.Валюта;
	Склад 				= ДокументОснование.Склад;
	
	//потолок
	НоваяСтрока = Товары.Добавить();
	НоваяСтрока.Номенклатура 	= ДокументОснование.ПродукцияНоменклатура;
	НоваяСтрока.Количество 		= ДокументОснование.ПродукцияНоменклатураКоличество;
	НоваяСтрока.ЕдиницаИзмерения = ДокументОснование.ПродукцияНоменклатураЕдиницаИзмерения;
	НоваяСтрока.Коэффициент 	= ДокументОснование.ПродукцияНоменклатураКоэффициент;
	НоваяСтрока.Цена 			= ДокументОснование.ПродукцияЦена;
	НоваяСтрока.Сумма 			= ДокументОснование.ПродукцияСумма;
	//#15395 
	//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание; // #15628 закомментировано
	
	ОснованиеЗаказПокупаетля = Документы.ЗаказПокупателя.ПустаяСсылка();
	Если ДокументОснование.ДокументОснование <> Неопределено 
		И ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
		И НЕ ДокументОснование.ДокументОснование.Пустая() 
	Тогда
		ОснованиеЗаказПокупаетля = ДокументОснование.ДокументОснование;
	КонецЕсли;
	
	НоваяСтрока.ЗаказПокупателя = ОснованиеЗаказПокупаетля;
	
	//услуги потолка
	Для каждого СтрокаУслуги Из ДокументОснование.Услуги Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
		НоваяСтрока.ЗаказПокупателя = ОснованиеЗаказПокупаетля;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоВыпуску(ДокументОснование)
	
	Основание 			= ДокументОснование;
	Организация 		= ДокументОснование.Организация;
	Подразделение 		= ДокументОснование.Подразделение;
	Склад  				= ДокументОснование.СкладПродукции;
	
	НоваяСтрока = Товары.Добавить();
	НоваяСтрока.Номенклатура = ДокументОснование.ПродукцияНоменклатура;
	НоваяСтрока.Количество = ДокументОснование.ПродукцияНоменклатураКоличество;
	НоваяСтрока.ЕдиницаИзмерения = ДокументОснование.ПродукцияНоменклатураЕдиницаИзмерения;
	НоваяСтрока.Коэффициент = ДокументОснование.ПродукцияНоменклатураКоэффициент;
	НоваяСтрока.Цена = ДокументОснование.Основание.ПродукцияЦена;
	НоваяСтрока.Сумма = ДокументОснование.Основание.ПродукцияСумма;
	//#15395 
	//НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание; // #15628 закомментировано
	
	ОснованиеЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
	Если ДокументОснование.Основание <> Неопределено И НЕ ДокументОснование.Основание.Пустая() Тогда
		Если ДокументОснование.Основание.ДокументОснование <> Неопределено 
			И ТипЗнч(ДокументОснование.Основание.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
			И НЕ ДокументОснование.Основание.ДокументОснование.Пустая() 
			Тогда
			ОснованиеЗаказПокупателя = ДокументОснование.Основание.ДокументОснование;
		КонецЕсли;
	КонецЕсли;
	
	НоваяСтрока.ЗаказПокупателя = ОснованиеЗаказПокупателя;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСуммуЗачета() Экспорт
	
	Если УменьшитьДолгКонтрагента Тогда
		СуммаЗачета = СуммаДокумента;
	Иначе
		СуммаЗачета = 0;
	КонецЕсли;
	
	Возврат СуммаЗачета;
	
КонецФункции

Функция ПолучитьТаблицуПродажПоЗаказу(ЗаказПокупателя, ДокументСсылка = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор <> &Регистратор
	|	И ПродажиОбороты.ЗаказПокупателя = &ЗаказПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.СерияНоменклатуры,
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ.ДокументПродажи КАК ДокументПродажи,
	|	ВТ.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТ.Количество КАК Количество
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Количество > 0";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПродаж;
	
КонецФункции

Функция НайтиДокументПродажиПоДаннымТабличнойСтроки(ТаблицаПродаж, СтрокаТабличнойЧасти, ЗаказПокупателя)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
	СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураПоиска.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
	СтруктураПоиска.Вставить("ЗаказПокупателя", 				 ЗаказПокупателя);
	
	НайденныеСтроки = ТаблицаПродаж.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].ДокументПродажи;
	КонецЕсли;
	
	Возврат Документы.РеализацияТоваровИУслуг.ПустаяСсылка();
	
КонецФункции	
	
#КонецОбласти

#КонецЕсли
